{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"outputs": {"Identity:0": {"name": "Identity:0"}}}, "modelTopology": {"node": [{"name": "model_3/tf.strided_slice_30/ones_like/tensor", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_3/tf.strided_slice_30/StridedSlice/end", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_3/tf.strided_slice_30/ones_like", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_3/tf.strided_slice_28/ones_like/tensor", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_3/tf.strided_slice_28/StridedSlice/end", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_3/tf.strided_slice_28/ones_like", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_3/tf.strided_slice_26/ones_like/tensor", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_3/tf.strided_slice_26/StridedSlice/end", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_3/tf.strided_slice_26/ones_like", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_3/tf.strided_slice_24/ones_like/tensor", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_3/tf.strided_slice_24/StridedSlice/end", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_3/tf.strided_slice_24/ones_like", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_3/tf.compat.v1.pad_15/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model_3/tf.nn.convolution_78/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_114/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.compat.v1.pad_16/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model_3/tf.nn.convolution_79/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_115/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.nn.convolution_80/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_116/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.strided_slice_25/ones_like/tensor", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_3/tf.strided_slice_25/StridedSlice/end", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_3/tf.strided_slice_25/ones_like", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_3/tf.nn.convolution_81/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_117/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.nn.convolution_82/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_118/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.concat_12/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model_3/tf.nn.convolution_83/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_121/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.compat.v1.pad_17/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model_3/tf.nn.convolution_84/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_122/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.nn.convolution_85/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_123/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.strided_slice_27/ones_like/tensor", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_3/tf.strided_slice_27/StridedSlice/end", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_3/tf.strided_slice_27/ones_like", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_3/tf.nn.convolution_86/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_124/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.nn.convolution_87/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_125/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.nn.convolution_88/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_128/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.nn.convolution_89/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_129/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.concat_13/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model_3/tf.nn.convolution_90/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_132/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.compat.v1.pad_18/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model_3/tf.nn.convolution_91/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_133/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.nn.convolution_92/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_134/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.strided_slice_29/ones_like/tensor", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_3/tf.strided_slice_29/StridedSlice/end", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_3/tf.strided_slice_29/ones_like", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_3/tf.nn.convolution_93/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_135/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.nn.convolution_94/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_136/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.nn.convolution_95/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_139/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.nn.convolution_96/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_140/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.concat_14/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model_3/tf.nn.convolution_97/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_143/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.compat.v1.pad_19/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model_3/tf.nn.convolution_98/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_144/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.nn.convolution_99/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_145/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.strided_slice_31/ones_like/tensor", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_3/tf.strided_slice_31/StridedSlice/end", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_3/tf.strided_slice_31/ones_like", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "model_3/tf.nn.convolution_100/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_146/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.nn.convolution_101/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_147/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.concat_15/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model_3/tf.nn.convolution_102/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "768"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_150/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.nn.convolution_103/convolution/filter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "1280"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_151/Add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1280"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.reduce_mean_3/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model_3/tf.compat.v1.transpose_131/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model_3/tf.reshape_3/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "model_3/tf.linalg.matmul_3/MatMul/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1280"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.__operators__.add_3/AddV2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "x", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.compat.v1.pad_15/Pad", "op": "Pad", "input": ["x", "model_3/tf.compat.v1.pad_15/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_114/Add", "op": "_FusedConv2D", "input": ["model_3/tf.compat.v1.pad_15/Pad", "model_3/tf.nn.convolution_78/convolution/filter", "model_3/tf.math.add_114/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_3/tf.math.sigmoid_78/Sigmoid", "op": "Sigmoid", "input": ["model_3/tf.math.add_114/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.multiply_354/Mul", "op": "Mul", "input": ["model_3/tf.math.add_114/Add", "model_3/tf.math.sigmoid_78/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.compat.v1.pad_16/Pad", "op": "Pad", "input": ["model_3/tf.math.multiply_354/Mul", "model_3/tf.compat.v1.pad_16/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_115/Add", "op": "_FusedConv2D", "input": ["model_3/tf.compat.v1.pad_16/Pad", "model_3/tf.nn.convolution_79/convolution/filter", "model_3/tf.math.add_115/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_3/tf.math.sigmoid_79/Sigmoid", "op": "Sigmoid", "input": ["model_3/tf.math.add_115/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.multiply_358/Mul", "op": "Mul", "input": ["model_3/tf.math.add_115/Add", "model_3/tf.math.sigmoid_79/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_116/Add", "op": "_FusedConv2D", "input": ["model_3/tf.math.multiply_358/Mul", "model_3/tf.nn.convolution_80/convolution/filter", "model_3/tf.math.add_116/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_3/tf.math.sigmoid_80/Sigmoid", "op": "Sigmoid", "input": ["model_3/tf.math.add_116/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.multiply_362/Mul", "op": "Mul", "input": ["model_3/tf.math.add_116/Add", "model_3/tf.math.sigmoid_80/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.strided_slice_24/StridedSlice", "op": "StridedSlice", "input": ["model_3/tf.math.multiply_362/Mul", "model_3/tf.strided_slice_24/ones_like/tensor", "model_3/tf.strided_slice_24/StridedSlice/end", "model_3/tf.strided_slice_24/ones_like"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "begin_mask": {"i": "15"}, "end_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "model_3/tf.strided_slice_25/StridedSlice", "op": "StridedSlice", "input": ["model_3/tf.math.multiply_362/Mul", "model_3/tf.strided_slice_25/ones_like/tensor", "model_3/tf.strided_slice_25/StridedSlice/end", "model_3/tf.strided_slice_25/ones_like"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "begin_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "7"}, "ellipsis_mask": {"i": "0"}}}, {"name": "model_3/tf.math.add_117/Add", "op": "_FusedConv2D", "input": ["model_3/tf.strided_slice_25/StridedSlice", "model_3/tf.nn.convolution_81/convolution/filter", "model_3/tf.math.add_117/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_3/tf.math.sigmoid_81/Sigmoid", "op": "Sigmoid", "input": ["model_3/tf.math.add_117/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.multiply_366/Mul", "op": "Mul", "input": ["model_3/tf.math.add_117/Add", "model_3/tf.math.sigmoid_81/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_118/Add", "op": "_FusedConv2D", "input": ["model_3/tf.math.multiply_366/Mul", "model_3/tf.nn.convolution_82/convolution/filter", "model_3/tf.math.add_118/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_3/tf.math.sigmoid_82/Sigmoid", "op": "Sigmoid", "input": ["model_3/tf.math.add_118/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.multiply_370/Mul", "op": "Mul", "input": ["model_3/tf.math.add_118/Add", "model_3/tf.math.sigmoid_82/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_120/Add", "op": "AddV2", "input": ["model_3/tf.strided_slice_25/StridedSlice", "model_3/tf.math.multiply_370/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.concat_12/concat", "op": "ConcatV2", "input": ["model_3/tf.strided_slice_24/StridedSlice", "model_3/tf.strided_slice_25/StridedSlice", "model_3/tf.math.add_120/Add", "model_3/tf.concat_12/concat/axis"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "model_3/tf.math.add_121/Add", "op": "_FusedConv2D", "input": ["model_3/tf.concat_12/concat", "model_3/tf.nn.convolution_83/convolution/filter", "model_3/tf.math.add_121/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_3/tf.math.sigmoid_83/Sigmoid", "op": "Sigmoid", "input": ["model_3/tf.math.add_121/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.multiply_376/Mul", "op": "Mul", "input": ["model_3/tf.math.add_121/Add", "model_3/tf.math.sigmoid_83/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.compat.v1.pad_17/Pad", "op": "Pad", "input": ["model_3/tf.math.multiply_376/Mul", "model_3/tf.compat.v1.pad_17/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_122/Add", "op": "_FusedConv2D", "input": ["model_3/tf.compat.v1.pad_17/Pad", "model_3/tf.nn.convolution_84/convolution/filter", "model_3/tf.math.add_122/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_3/tf.math.sigmoid_84/Sigmoid", "op": "Sigmoid", "input": ["model_3/tf.math.add_122/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.multiply_380/Mul", "op": "Mul", "input": ["model_3/tf.math.add_122/Add", "model_3/tf.math.sigmoid_84/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_123/Add", "op": "_FusedConv2D", "input": ["model_3/tf.math.multiply_380/Mul", "model_3/tf.nn.convolution_85/convolution/filter", "model_3/tf.math.add_123/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_3/tf.math.sigmoid_85/Sigmoid", "op": "Sigmoid", "input": ["model_3/tf.math.add_123/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.multiply_384/Mul", "op": "Mul", "input": ["model_3/tf.math.add_123/Add", "model_3/tf.math.sigmoid_85/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.strided_slice_26/StridedSlice", "op": "StridedSlice", "input": ["model_3/tf.math.multiply_384/Mul", "model_3/tf.strided_slice_26/ones_like/tensor", "model_3/tf.strided_slice_26/StridedSlice/end", "model_3/tf.strided_slice_26/ones_like"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "15"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "7"}, "ellipsis_mask": {"i": "0"}}}, {"name": "model_3/tf.strided_slice_27/StridedSlice", "op": "StridedSlice", "input": ["model_3/tf.math.multiply_384/Mul", "model_3/tf.strided_slice_27/ones_like/tensor", "model_3/tf.strided_slice_27/StridedSlice/end", "model_3/tf.strided_slice_27/ones_like"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "begin_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "7"}, "ellipsis_mask": {"i": "0"}}}, {"name": "model_3/tf.math.add_124/Add", "op": "_FusedConv2D", "input": ["model_3/tf.strided_slice_27/StridedSlice", "model_3/tf.nn.convolution_86/convolution/filter", "model_3/tf.math.add_124/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_3/tf.math.sigmoid_86/Sigmoid", "op": "Sigmoid", "input": ["model_3/tf.math.add_124/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.multiply_388/Mul", "op": "Mul", "input": ["model_3/tf.math.add_124/Add", "model_3/tf.math.sigmoid_86/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_125/Add", "op": "_FusedConv2D", "input": ["model_3/tf.math.multiply_388/Mul", "model_3/tf.nn.convolution_87/convolution/filter", "model_3/tf.math.add_125/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_3/tf.math.sigmoid_87/Sigmoid", "op": "Sigmoid", "input": ["model_3/tf.math.add_125/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.multiply_392/Mul", "op": "Mul", "input": ["model_3/tf.math.add_125/Add", "model_3/tf.math.sigmoid_87/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_127/Add", "op": "AddV2", "input": ["model_3/tf.strided_slice_27/StridedSlice", "model_3/tf.math.multiply_392/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_128/Add", "op": "_FusedConv2D", "input": ["model_3/tf.math.add_127/Add", "model_3/tf.nn.convolution_88/convolution/filter", "model_3/tf.math.add_128/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_3/tf.math.sigmoid_88/Sigmoid", "op": "Sigmoid", "input": ["model_3/tf.math.add_128/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.multiply_398/Mul", "op": "Mul", "input": ["model_3/tf.math.add_128/Add", "model_3/tf.math.sigmoid_88/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_129/Add", "op": "_FusedConv2D", "input": ["model_3/tf.math.multiply_398/Mul", "model_3/tf.nn.convolution_89/convolution/filter", "model_3/tf.math.add_129/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_3/tf.math.sigmoid_89/Sigmoid", "op": "Sigmoid", "input": ["model_3/tf.math.add_129/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.multiply_402/Mul", "op": "Mul", "input": ["model_3/tf.math.add_129/Add", "model_3/tf.math.sigmoid_89/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_131/Add", "op": "AddV2", "input": ["model_3/tf.math.add_127/Add", "model_3/tf.math.multiply_402/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.concat_13/concat", "op": "ConcatV2", "input": ["model_3/tf.strided_slice_26/StridedSlice", "model_3/tf.strided_slice_27/StridedSlice", "model_3/tf.math.add_127/Add", "model_3/tf.math.add_131/Add", "model_3/tf.concat_13/concat/axis"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "model_3/tf.math.add_132/Add", "op": "_FusedConv2D", "input": ["model_3/tf.concat_13/concat", "model_3/tf.nn.convolution_90/convolution/filter", "model_3/tf.math.add_132/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_3/tf.math.sigmoid_90/Sigmoid", "op": "Sigmoid", "input": ["model_3/tf.math.add_132/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.multiply_408/Mul", "op": "Mul", "input": ["model_3/tf.math.add_132/Add", "model_3/tf.math.sigmoid_90/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.compat.v1.pad_18/Pad", "op": "Pad", "input": ["model_3/tf.math.multiply_408/Mul", "model_3/tf.compat.v1.pad_18/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_133/Add", "op": "_FusedConv2D", "input": ["model_3/tf.compat.v1.pad_18/Pad", "model_3/tf.nn.convolution_91/convolution/filter", "model_3/tf.math.add_133/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_3/tf.math.sigmoid_91/Sigmoid", "op": "Sigmoid", "input": ["model_3/tf.math.add_133/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.multiply_412/Mul", "op": "Mul", "input": ["model_3/tf.math.add_133/Add", "model_3/tf.math.sigmoid_91/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_134/Add", "op": "_FusedConv2D", "input": ["model_3/tf.math.multiply_412/Mul", "model_3/tf.nn.convolution_92/convolution/filter", "model_3/tf.math.add_134/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_3/tf.math.sigmoid_92/Sigmoid", "op": "Sigmoid", "input": ["model_3/tf.math.add_134/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.multiply_416/Mul", "op": "Mul", "input": ["model_3/tf.math.add_134/Add", "model_3/tf.math.sigmoid_92/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.strided_slice_28/StridedSlice", "op": "StridedSlice", "input": ["model_3/tf.math.multiply_416/Mul", "model_3/tf.strided_slice_28/ones_like/tensor", "model_3/tf.strided_slice_28/StridedSlice/end", "model_3/tf.strided_slice_28/ones_like"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "begin_mask": {"i": "15"}, "end_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "model_3/tf.strided_slice_29/StridedSlice", "op": "StridedSlice", "input": ["model_3/tf.math.multiply_416/Mul", "model_3/tf.strided_slice_29/ones_like/tensor", "model_3/tf.strided_slice_29/StridedSlice/end", "model_3/tf.strided_slice_29/ones_like"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "begin_mask": {"i": "7"}, "end_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "model_3/tf.math.add_135/Add", "op": "_FusedConv2D", "input": ["model_3/tf.strided_slice_29/StridedSlice", "model_3/tf.nn.convolution_93/convolution/filter", "model_3/tf.math.add_135/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_3/tf.math.sigmoid_93/Sigmoid", "op": "Sigmoid", "input": ["model_3/tf.math.add_135/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.multiply_420/Mul", "op": "Mul", "input": ["model_3/tf.math.add_135/Add", "model_3/tf.math.sigmoid_93/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_136/Add", "op": "_FusedConv2D", "input": ["model_3/tf.math.multiply_420/Mul", "model_3/tf.nn.convolution_94/convolution/filter", "model_3/tf.math.add_136/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_3/tf.math.sigmoid_94/Sigmoid", "op": "Sigmoid", "input": ["model_3/tf.math.add_136/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.multiply_424/Mul", "op": "Mul", "input": ["model_3/tf.math.add_136/Add", "model_3/tf.math.sigmoid_94/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_138/Add", "op": "AddV2", "input": ["model_3/tf.strided_slice_29/StridedSlice", "model_3/tf.math.multiply_424/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_139/Add", "op": "_FusedConv2D", "input": ["model_3/tf.math.add_138/Add", "model_3/tf.nn.convolution_95/convolution/filter", "model_3/tf.math.add_139/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_3/tf.math.sigmoid_95/Sigmoid", "op": "Sigmoid", "input": ["model_3/tf.math.add_139/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.multiply_430/Mul", "op": "Mul", "input": ["model_3/tf.math.add_139/Add", "model_3/tf.math.sigmoid_95/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_140/Add", "op": "_FusedConv2D", "input": ["model_3/tf.math.multiply_430/Mul", "model_3/tf.nn.convolution_96/convolution/filter", "model_3/tf.math.add_140/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_3/tf.math.sigmoid_96/Sigmoid", "op": "Sigmoid", "input": ["model_3/tf.math.add_140/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.multiply_434/Mul", "op": "Mul", "input": ["model_3/tf.math.add_140/Add", "model_3/tf.math.sigmoid_96/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_142/Add", "op": "AddV2", "input": ["model_3/tf.math.add_138/Add", "model_3/tf.math.multiply_434/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.concat_14/concat", "op": "ConcatV2", "input": ["model_3/tf.strided_slice_28/StridedSlice", "model_3/tf.strided_slice_29/StridedSlice", "model_3/tf.math.add_138/Add", "model_3/tf.math.add_142/Add", "model_3/tf.concat_14/concat/axis"], "attr": {"N": {"i": "4"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "model_3/tf.math.add_143/Add", "op": "_FusedConv2D", "input": ["model_3/tf.concat_14/concat", "model_3/tf.nn.convolution_97/convolution/filter", "model_3/tf.math.add_143/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_3/tf.math.sigmoid_97/Sigmoid", "op": "Sigmoid", "input": ["model_3/tf.math.add_143/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.multiply_440/Mul", "op": "Mul", "input": ["model_3/tf.math.add_143/Add", "model_3/tf.math.sigmoid_97/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.compat.v1.pad_19/Pad", "op": "Pad", "input": ["model_3/tf.math.multiply_440/Mul", "model_3/tf.compat.v1.pad_19/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_144/Add", "op": "_FusedConv2D", "input": ["model_3/tf.compat.v1.pad_19/Pad", "model_3/tf.nn.convolution_98/convolution/filter", "model_3/tf.math.add_144/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_3/tf.math.sigmoid_98/Sigmoid", "op": "Sigmoid", "input": ["model_3/tf.math.add_144/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.multiply_444/Mul", "op": "Mul", "input": ["model_3/tf.math.add_144/Add", "model_3/tf.math.sigmoid_98/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_145/Add", "op": "_FusedConv2D", "input": ["model_3/tf.math.multiply_444/Mul", "model_3/tf.nn.convolution_99/convolution/filter", "model_3/tf.math.add_145/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_3/tf.math.sigmoid_99/Sigmoid", "op": "Sigmoid", "input": ["model_3/tf.math.add_145/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.multiply_448/Mul", "op": "Mul", "input": ["model_3/tf.math.add_145/Add", "model_3/tf.math.sigmoid_99/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.strided_slice_30/StridedSlice", "op": "StridedSlice", "input": ["model_3/tf.math.multiply_448/Mul", "model_3/tf.strided_slice_30/ones_like/tensor", "model_3/tf.strided_slice_30/StridedSlice/end", "model_3/tf.strided_slice_30/ones_like"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "begin_mask": {"i": "15"}, "end_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "model_3/tf.strided_slice_31/StridedSlice", "op": "StridedSlice", "input": ["model_3/tf.math.multiply_448/Mul", "model_3/tf.strided_slice_31/ones_like/tensor", "model_3/tf.strided_slice_31/StridedSlice/end", "model_3/tf.strided_slice_31/ones_like"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "7"}, "ellipsis_mask": {"i": "0"}}}, {"name": "model_3/tf.math.add_146/Add", "op": "_FusedConv2D", "input": ["model_3/tf.strided_slice_31/StridedSlice", "model_3/tf.nn.convolution_100/convolution/filter", "model_3/tf.math.add_146/Add/y"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "model_3/tf.math.sigmoid_100/Sigmoid", "op": "Sigmoid", "input": ["model_3/tf.math.add_146/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.multiply_452/Mul", "op": "Mul", "input": ["model_3/tf.math.add_146/Add", "model_3/tf.math.sigmoid_100/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "model_3/tf.math.add_147/Add", "op": "_FusedConv2D", "input": 